{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "init",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "init",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "data",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage0_0\/1\/dw",
      "blob_weights" : 7,
      "K" : 24,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "stage0_0\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 24,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "init",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage0_0\/2\/pw-linear",
      "blob_weights" : 11,
      "K" : 24,
      "blob_biases" : 9,
      "name" : "stage0_0\/2\/pw-linear",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "stage0_0\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage1_0\/1\/pw",
      "blob_weights" : 15,
      "K" : 32,
      "blob_biases" : 13,
      "name" : "stage1_0\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "stage0_0\/2\/pw-linear",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage1_0\/2\/dw",
      "blob_weights" : 19,
      "K" : 64,
      "blob_biases" : 17,
      "name" : "stage1_0\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "stage1_0\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage1_0\/3\/pw-linear",
      "blob_weights" : 23,
      "K" : 64,
      "blob_biases" : 21,
      "name" : "stage1_0\/3\/pw-linear",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "stage1_0\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage2_0\/1\/pw",
      "blob_weights" : 27,
      "K" : 48,
      "blob_biases" : 25,
      "name" : "stage2_0\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "stage1_0\/3\/pw-linear",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage2_0\/2\/dw",
      "blob_weights" : 31,
      "K" : 144,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "stage2_0\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "stage2_0\/1\/pw",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage2_0\/3\/pw-linear",
      "blob_weights" : 35,
      "K" : 144,
      "blob_biases" : 33,
      "name" : "stage2_0\/3\/pw-linear",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "stage2_0\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage3_0\/1\/pw",
      "blob_weights" : 39,
      "K" : 64,
      "blob_biases" : 37,
      "name" : "stage3_0\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "stage2_0\/3\/pw-linear",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage3_0\/2\/dw",
      "blob_weights" : 43,
      "K" : 192,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "stage3_0\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "stage3_0\/1\/pw",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage3_0\/3\/pw-linear",
      "blob_weights" : 47,
      "K" : 192,
      "blob_biases" : 45,
      "name" : "stage3_0\/3\/pw-linear",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "stage3_0\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage3_1\/1\/pw",
      "blob_weights" : 51,
      "K" : 96,
      "blob_biases" : 49,
      "name" : "stage3_1\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "stage3_0\/3\/pw-linear",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage3_1\/2\/dw",
      "blob_weights" : 55,
      "K" : 288,
      "blob_biases" : 53,
      "name" : "stage3_1\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 288,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 288,
      "bottom" : "stage3_1\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage3_1\/3\/pw-linear",
      "blob_weights" : 59,
      "K" : 288,
      "blob_biases" : 57,
      "name" : "stage3_1\/3\/pw-linear",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "stage3_1\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage3_0\/3\/pw-linear,stage3_1\/3\/pw-linear",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage3_1\/sum",
      "type" : "elementwise",
      "name" : "stage3_1\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage4_0\/1\/pw",
      "blob_weights" : 63,
      "K" : 96,
      "blob_biases" : 61,
      "name" : "stage4_0\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "stage3_1\/sum",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage4_0\/2\/dw",
      "blob_weights" : 67,
      "K" : 192,
      "blob_biases" : 65,
      "name" : "stage4_0\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "stage4_0\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage4_0\/3\/pw-linear",
      "blob_weights" : 71,
      "K" : 192,
      "blob_biases" : 69,
      "name" : "stage4_0\/3\/pw-linear",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "stage4_0\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage4_1\/1\/pw",
      "blob_weights" : 75,
      "K" : 128,
      "blob_biases" : 73,
      "name" : "stage4_1\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "stage4_0\/3\/pw-linear",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage4_1\/2\/dw",
      "blob_weights" : 79,
      "K" : 256,
      "blob_biases" : 77,
      "name" : "stage4_1\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "stage4_1\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage4_1\/3\/pw-linear",
      "blob_weights" : 83,
      "K" : 256,
      "blob_biases" : 81,
      "name" : "stage4_1\/3\/pw-linear",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "stage4_1\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage4_0\/3\/pw-linear,stage4_1\/3\/pw-linear",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage4_1\/sum",
      "type" : "elementwise",
      "name" : "stage4_1\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage4_2\/1\/pw",
      "blob_weights" : 87,
      "K" : 128,
      "blob_biases" : 85,
      "name" : "stage4_2\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "stage4_1\/sum",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "stage4_2\/2\/dw",
      "blob_weights" : 91,
      "K" : 256,
      "blob_biases" : 89,
      "name" : "stage4_2\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "stage4_2\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stage4_2\/3\/pw-linear",
      "blob_weights" : 95,
      "K" : 256,
      "blob_biases" : 93,
      "name" : "stage4_2\/3\/pw-linear",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "stage4_2\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "stage4_1\/sum,stage4_2\/3\/pw-linear",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "stage4_2\/sum",
      "type" : "elementwise",
      "name" : "stage4_2\/sum",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "final_stage",
      "blob_weights" : 99,
      "K" : 128,
      "blob_biases" : 97,
      "name" : "final_stage",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "stage4_2\/sum",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "upscale",
      "blob_weights" : 101,
      "K" : 64,
      "stride_x" : 2,
      "name" : "upscale",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "final_stage",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature1to2",
      "blob_weights" : 105,
      "K" : 64,
      "blob_biases" : 103,
      "name" : "feature1to2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "stage2_0\/3\/pw-linear",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "upscale,feature1to2",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "main\/features",
      "type" : "elementwise",
      "name" : "main\/features",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/0\/dw",
      "blob_weights" : 109,
      "K" : 64,
      "blob_biases" : 107,
      "name" : "feature_stage1\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "main\/features",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/0\/pw",
      "blob_weights" : 113,
      "K" : 64,
      "blob_biases" : 111,
      "name" : "feature_stage1\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/1\/dw",
      "blob_weights" : 117,
      "K" : 64,
      "blob_biases" : 115,
      "name" : "feature_stage1\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/1\/pw",
      "blob_weights" : 121,
      "K" : 64,
      "blob_biases" : 119,
      "name" : "feature_stage1\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/2\/dw",
      "blob_weights" : 125,
      "K" : 64,
      "blob_biases" : 123,
      "name" : "feature_stage1\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/2\/pw",
      "blob_weights" : 129,
      "K" : 64,
      "blob_biases" : 127,
      "name" : "feature_stage1\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/3\/dw",
      "blob_weights" : 133,
      "K" : 64,
      "blob_biases" : 131,
      "name" : "feature_stage1\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/3\/pw",
      "blob_weights" : 137,
      "K" : 64,
      "blob_biases" : 135,
      "name" : "feature_stage1\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage1\/2nd\/4\/dw",
      "blob_weights" : 141,
      "K" : 64,
      "blob_biases" : 139,
      "name" : "feature_stage1\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage1\/2nd\/4\/pw",
      "blob_weights" : 145,
      "K" : 64,
      "blob_biases" : 143,
      "name" : "feature_stage1\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage1\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "main\/layer_combine1",
      "type" : "concat",
      "name" : "main\/layer_combine1",
      "bottom" : "main\/features,feature_stage1\/2nd\/4\/pw"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/0\/dw",
      "blob_weights" : 149,
      "K" : 128,
      "blob_biases" : 147,
      "name" : "feature_stage2\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "main\/layer_combine1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/0\/pw",
      "blob_weights" : 153,
      "K" : 128,
      "blob_biases" : 151,
      "name" : "feature_stage2\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/1\/dw",
      "blob_weights" : 157,
      "K" : 64,
      "blob_biases" : 155,
      "name" : "feature_stage2\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/1\/pw",
      "blob_weights" : 161,
      "K" : 64,
      "blob_biases" : 159,
      "name" : "feature_stage2\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/2\/dw",
      "blob_weights" : 165,
      "K" : 64,
      "blob_biases" : 163,
      "name" : "feature_stage2\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/2\/pw",
      "blob_weights" : 169,
      "K" : 64,
      "blob_biases" : 167,
      "name" : "feature_stage2\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/3\/dw",
      "blob_weights" : 173,
      "K" : 64,
      "blob_biases" : 171,
      "name" : "feature_stage2\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/3\/pw",
      "blob_weights" : 177,
      "K" : 64,
      "blob_biases" : 175,
      "name" : "feature_stage2\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage2\/2nd\/4\/dw",
      "blob_weights" : 181,
      "K" : 64,
      "blob_biases" : 179,
      "name" : "feature_stage2\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage2\/2nd\/4\/pw",
      "blob_weights" : 185,
      "K" : 64,
      "blob_biases" : 183,
      "name" : "feature_stage2\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage2\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "main\/layer_combine2",
      "type" : "concat",
      "name" : "main\/layer_combine2",
      "bottom" : "main\/features,feature_stage2\/2nd\/4\/pw"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/0\/dw",
      "blob_weights" : 189,
      "K" : 128,
      "blob_biases" : 187,
      "name" : "feature_stage3\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "main\/layer_combine2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/0\/pw",
      "blob_weights" : 193,
      "K" : 128,
      "blob_biases" : 191,
      "name" : "feature_stage3\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/1\/dw",
      "blob_weights" : 197,
      "K" : 64,
      "blob_biases" : 195,
      "name" : "feature_stage3\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/1\/pw",
      "blob_weights" : 201,
      "K" : 64,
      "blob_biases" : 199,
      "name" : "feature_stage3\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/2\/dw",
      "blob_weights" : 205,
      "K" : 64,
      "blob_biases" : 203,
      "name" : "feature_stage3\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/2\/pw",
      "blob_weights" : 209,
      "K" : 64,
      "blob_biases" : 207,
      "name" : "feature_stage3\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/3\/dw",
      "blob_weights" : 213,
      "K" : 64,
      "blob_biases" : 211,
      "name" : "feature_stage3\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/3\/pw",
      "blob_weights" : 217,
      "K" : 64,
      "blob_biases" : 215,
      "name" : "feature_stage3\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage3\/2nd\/4\/dw",
      "blob_weights" : 221,
      "K" : 64,
      "blob_biases" : 219,
      "name" : "feature_stage3\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage3\/2nd\/4\/pw",
      "blob_weights" : 225,
      "K" : 64,
      "blob_biases" : 223,
      "name" : "feature_stage3\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage3\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "main\/layer_combine3",
      "type" : "concat",
      "name" : "main\/layer_combine3",
      "bottom" : "main\/features,feature_stage3\/2nd\/4\/pw"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/0\/dw",
      "blob_weights" : 229,
      "K" : 128,
      "blob_biases" : 227,
      "name" : "feature_stage4\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "main\/layer_combine3",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/0\/pw",
      "blob_weights" : 233,
      "K" : 128,
      "blob_biases" : 231,
      "name" : "feature_stage4\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/1\/dw",
      "blob_weights" : 237,
      "K" : 64,
      "blob_biases" : 235,
      "name" : "feature_stage4\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/1\/pw",
      "blob_weights" : 241,
      "K" : 64,
      "blob_biases" : 239,
      "name" : "feature_stage4\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/2\/dw",
      "blob_weights" : 245,
      "K" : 64,
      "blob_biases" : 243,
      "name" : "feature_stage4\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/2\/pw",
      "blob_weights" : 249,
      "K" : 64,
      "blob_biases" : 247,
      "name" : "feature_stage4\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/3\/dw",
      "blob_weights" : 253,
      "K" : 64,
      "blob_biases" : 251,
      "name" : "feature_stage4\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/3\/pw",
      "blob_weights" : 257,
      "K" : 64,
      "blob_biases" : 255,
      "name" : "feature_stage4\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage4\/2nd\/4\/dw",
      "blob_weights" : 261,
      "K" : 64,
      "blob_biases" : 259,
      "name" : "feature_stage4\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage4\/2nd\/4\/pw",
      "blob_weights" : 265,
      "K" : 64,
      "blob_biases" : 263,
      "name" : "feature_stage4\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage4\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "main\/layer_combine4",
      "type" : "concat",
      "name" : "main\/layer_combine4",
      "bottom" : "main\/features,feature_stage4\/2nd\/4\/pw"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage5\/2nd\/0\/dw",
      "blob_weights" : 269,
      "K" : 128,
      "blob_biases" : 267,
      "name" : "feature_stage5\/2nd\/0\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "main\/layer_combine4",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage5\/2nd\/0\/pw",
      "blob_weights" : 273,
      "K" : 128,
      "blob_biases" : 271,
      "name" : "feature_stage5\/2nd\/0\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/0\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage5\/2nd\/1\/dw",
      "blob_weights" : 277,
      "K" : 64,
      "blob_biases" : 275,
      "name" : "feature_stage5\/2nd\/1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/0\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage5\/2nd\/1\/pw",
      "blob_weights" : 281,
      "K" : 64,
      "blob_biases" : 279,
      "name" : "feature_stage5\/2nd\/1\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage5\/2nd\/2\/dw",
      "blob_weights" : 285,
      "K" : 64,
      "blob_biases" : 283,
      "name" : "feature_stage5\/2nd\/2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/1\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage5\/2nd\/2\/pw",
      "blob_weights" : 289,
      "K" : 64,
      "blob_biases" : 287,
      "name" : "feature_stage5\/2nd\/2\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage5\/2nd\/3\/dw",
      "blob_weights" : 293,
      "K" : 64,
      "blob_biases" : 291,
      "name" : "feature_stage5\/2nd\/3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/2\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage5\/2nd\/3\/pw",
      "blob_weights" : 297,
      "K" : 64,
      "blob_biases" : 295,
      "name" : "feature_stage5\/2nd\/3\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "feature_stage5\/2nd\/4\/dw",
      "blob_weights" : 301,
      "K" : 64,
      "blob_biases" : 299,
      "name" : "feature_stage5\/2nd\/4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/3\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage5\/2nd\/4\/pw",
      "blob_weights" : 305,
      "K" : 64,
      "blob_biases" : 303,
      "name" : "feature_stage5\/2nd\/4\/pw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "feature_stage5\/2nd\/4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "feature_stage5_regression\/2nd\/final_306feature_stage5_regression2nd\/sigmoid",
      "blob_weights" : 309,
      "K" : 64,
      "blob_biases" : 307,
      "name" : "feature_stage5_regression\/2nd\/final",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 15,
      "bottom" : "feature_stage5\/2nd\/4\/pw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 3,
      "weights" : {

      },
